[
  {
    "title": "Desarrollador Full Stack",
    "organization": "Ecoprintq Chile",
    "description": [
      "Responsable del desarrollo del producto principal de la empresa, una plataforma de automatización de tareas en tiempo real, con una gran cantidad de procesamiento de datos concurrentes.",
      "Implementé nuevas funcionalidades y optimizaciones que mejoraron significativamente la eficiencia, calidad y estabilidad del sistema, fortaleciendo el producto y eliminando errores críticos.",
      "Solucioné incidencias críticas del sistema mediante un sistema de investigación, documentación y pruebas controladas.",
      "La resolución de estas fallas permitió optimizar componentes adicionales y mejorar la estabilidad general del sistema. Esto redujo significativamente el tiempo destinado a soporte y fortaleció la confianza del cliente durante presentaciones, facilitando la comercialización del producto.",
      "Estas mejoras facilitaron la escalabilidad del producto y su adopción por parte de grandes clientes como Falabella, Ricoh LATAM, HP y Agrosuper."
    ],
    "start": "SEP 2024"
  },
  {
    "title": "Desarrollador Full Stack",
    "organization": "Acroventus SPA",
    "description": [
      "Lideré el desarrollo full stack de soldautos.cl, una plataforma de compra y venta de vehículos para automotoras y particulares.",
      "Esto permitió al cliente abrir una nueva línea de negocio, facilitando la venta a diversas automotoras importantes del sector. Como resultado, el sitio mantiene un catálogo activo con más de mil publicaciones.",
      "Diseñé la arquitectura de varios sistemas y coordiné al equipo de desarrolladores, lo que permitió entregar con éxito múltiples proyectos a nuestros clientes.",
      "Implementé y realicé mentorías sobre buenas prácticas de desarrollo (arquitectura limpia, principios SOLID, testing), lo que permitió estandarizar metodologías y mejorar la calidad del código en múltiples equipos de la empresa.",
      "Desarrollé herramientas internas, incluyendo un sistema para la toma de requerimientos (Sprint Zero) y una CLI para la configuración de nuevos proyectos.",
      "Estas herramientas permitieron reutilizar integraciones comunes (autenticación, despliegues, APIs como WhatsApp y Slack), reduciendo tiempos de desarrollo y mejorando la productividad en nuevos proyectos."
    ],
    "start": "NOV 2022",
    "end": "MAY 2024"
  },
  {
    "title": "Desarrollador Full stack",
    "organization": "MINEDUC-UFRO",
    "description": [
      "Desarrollé un sistema que digitalizó el acceso a convenios nacionales e internacionales de la Universidad de La Frontera, reemplazando procesos manuales y mejorando significativamente la eficiencia operativa.",
      "Gracias al impacto del proyecto, la universidad decidió continuar financiando nuevas iniciativas con nuestro equipo.",
      "Desarrollé y participé en el diseño arquitectónico de SISDAE, un sistema para la gestión de recursos y beneficios estudiantiles de la Universidad de La Frontera.",
      "Mi desempeño en este y otros proyectos llevó a que Acroventus, empresa externa encargada de otros desarrollos, me ofreciera unirme a su equipo de forma indefinida."
    ],
    "start": "MAR 2022",
    "end": "OCT 2022"
  }
]
